### Lean Tech Test

#### 1. Print the list ["hola", "mundo", "123"] as "1:hola,2:mundo,3:123".

In [117]:

x = ["hola", "mundo", "123"]
c = ""
v = 0
for i in x: 
    v = v +1
    if v < 3:
        c = c+str(v)+":"+str(i)+','
    else: 
        c = c+str(v)+":"+str(i)
print(c)

1:hola,2:mundo,3:123

#### 2. Create a dataframe with this values:

Mes  |Ventas |Gastos
-----|-----  |----- 
Enero|30500  |22000
Febrero|35600  |23400
Marzo|28300  |18100
Abril|33900  |20700

In [115]:
import pandas as pd

d = {'Mes':['Enero', 'Febrero', 'Marzo', 'Abril'],
    'Ventas':[30500, 35600, 28300, 33900],
     'Gastos':[22000, 23400, 18100, 20700]
    }

d = pd.DataFrame(d)
d

       Mes  Ventas  Gastos
0    Enero   30500   22000
1  Febrero   35600   23400
2    Marzo   28300   18100
3    Abril   33900   20700

#### 3. Calculate the total profit

In [110]:
d['Ventas'].sum() - d['Gastos'].sum()

44100

#### 4. Create a function that allow you to calculate the profit.

In [120]:
d = d.set_index('Mes')
d

         Ventas  Gastos
Mes
Enero     30500   22000
Febrero   35600   23400
Marzo     28300   18100
Abril     33900   20700

In [121]:
def mes(x):
    df = d.loc[x]
    return df['Ventas'].sum() - df['Gastos'].sum()

In [122]:
mes(['Enero', 'Febrero', 'Marzo'])

30900